common/models/User.php

SELECT * FROM `user` WHERE (`access_token`='fjDj6826jSYzQcKuU0T6Wa6Ws2IEp1Dw_1503319705') AND (`status`=10)
---
    public static function findIdentityByAccessToken($token, $type = null)
    {
        if (!self::isAccessTokenValid($token)) {
            throw new UnauthorizedHttpException('Access token is invalid');
        }
        return static::findOne(['access_token' => $token, 'status' => self::STATUS_ACTIVE]);