api/modules/v1/controllers/GoodsController.php

SELECT `id`, `name` FROM `goods` WHERE `name` != ''
---
    public function actionGetValidGoods()
    {
        $validGoods = Goods::find()
            ->select(['id', 'name'])
            ->where(['!=', 'name', ''])
            ->asArray()
            ->all();

SELECT `id`, `name` FROM `goods` WHERE `name`=''
UPDATE `goods` SET `name`='good' WHERE `id`=9
---
    public function actionFill()
    {
        $goods = Goods::find()->select(['id', 'name'])->where(['name' => ''])->all();
        $result = [];
        foreach ($goods as $k => $good) {
            $good->name = 'good';
            if ($good->save()) {