api/models/LoginForm.php

    public function login()
    {
        if ($this->validate()) {
            if (!User::isAccessTokenValid($this->_user->access_token)) {
                $this->_user->generateAccessToken();
                $this->_user->save();
---
UPDATE `user` SET `access_token`='fjDj6826jSYzQcKuU0T6Wa6Ws2IEp1Dw_1503319705', `updated_at`=1503319705 WHERE `id`=5